Terraform Plan:

```
random_password.db: Refreshing state... [id=none]
module.ecs_service.data.aws_region.current: Reading...
module.alb.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_partition.current: Reading...
aws_codestarconnections_connection.github: Refreshing state... [id=arn:aws:codestar-connections:us-east-1:205190502510:connection/0c4da746-06c5-4b4b-83a4-ac327c0382f5]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
aws_ecr_repository.backend: Refreshing state... [id=aws-java-ecs-s3-demo-dev-backend]
data.aws_iam_policy_document.codepipeline_assume: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=aws-java-ecs-s3-demo-dev-db-20251123044242912300000001]
module.ecs_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_option_group.aws_db_option_group.this[0]: Refreshing state... [id=aws-java-ecs-s3-demo-dev-db-20251123044242912300000003]
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0e575e23f3cb7b72c]
data.aws_availability_zones.available: Reading...
data.aws_iam_policy_document.codepipeline_assume: Read complete after 0s [id=2245101310]
data.aws_iam_policy_document.codebuild_assume: Reading...
aws_cloudwatch_log_group.ecs: Refreshing state... [id=/ecs/aws-java-ecs-s3-demo-dev]
module.ecs_cluster.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/ecs/aws-java-ecs-s3-demo-dev-cluster]
data.aws_iam_policy_document.codebuild_assume: Read complete after 0s [id=1229436035]
aws_iam_role.ecs_execution: Refreshing state... [id=aws-java-ecs-s3-demo-dev-ecs-execution-role]
module.network.data.aws_region.current: Reading...
module.network.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.frontend_s3.aws_s3_bucket.this: Refreshing state... [id=aws-java-ecs-s3-demo-dev-frontend]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
aws_s3_bucket.codepipeline_artifacts: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codepipeline-artifacts]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_partition.current: Reading...
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
aws_iam_role.codepipeline: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codepipeline]
aws_iam_role.codebuild_app: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codebuild-app]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=205190502510]
module.ecs_cluster.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:205190502510:cluster/aws-java-ecs-s3-demo-dev-cluster]
aws_iam_role_policy_attachment.ecs_execution_policy: Refreshing state... [id=aws-java-ecs-s3-demo-dev-ecs-execution-role-20251124053330040600000002]
module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=aws-java-ecs-s3-demo-dev-cluster]
module.frontend_s3.aws_s3_bucket_policy.this: Refreshing state... [id=aws-java-ecs-s3-demo-dev-frontend]
module.frontend_s3.aws_s3_bucket_public_access_block.this: Refreshing state... [id=aws-java-ecs-s3-demo-dev-frontend]
module.frontend_s3.aws_s3_bucket_ownership_controls.this: Refreshing state... [id=aws-java-ecs-s3-demo-dev-frontend]
module.frontend_s3.aws_s3_bucket_website_configuration.this: Refreshing state... [id=aws-java-ecs-s3-demo-dev-frontend]
aws_codebuild_project.app_build_deploy: Refreshing state... [id=arn:aws:codebuild:us-east-1:205190502510:project/aws-java-ecs-s3-demo-dev-app-build-deploy]
aws_s3_bucket_versioning.codepipeline_artifacts: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codepipeline-artifacts]
aws_s3_bucket_server_side_encryption_configuration.codepipeline_artifacts: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codepipeline-artifacts]
data.aws_iam_policy_document.codebuild_app: Reading...
data.aws_iam_policy_document.codebuild_app: Read complete after 0s [id=2027797337]
aws_iam_role_policy.codebuild_app: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codebuild-app:terraform-20251124100228321000000001]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fc829883bcd63567]
aws_security_group.db: Refreshing state... [id=sg-0175fbe41313601bc]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-04349112a801b4e02]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-049acd761987774ae]
module.alb.aws_lb_target_group.this["ecs_tg"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:205190502510:targetgroup/tf-20251123054628669300000002/82a2b76eb1f22b7f]
module.alb.aws_security_group.this[0]: Refreshing state... [id=sg-0d96d2d3eb7b30a11]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ae72c0084afde21d]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0fdb5798020f949c9]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-0101228a963935505]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-04fa192b98f201fa6]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0f575d805863dd1f2]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-0c9b7aa39767b7c41]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-08057180b21d2c12a]
data.aws_iam_policy_document.codepipeline: Reading...
data.aws_iam_policy_document.codepipeline: Read complete after 0s [id=2028258562]
aws_codepipeline.app: Refreshing state... [id=aws-java-ecs-s3-demo-dev-app]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-01728405088b76619]
aws_iam_role_policy.codepipeline: Refreshing state... [id=aws-java-ecs-s3-demo-dev-codepipeline:terraform-20251124100229697500000002]
module.alb.aws_vpc_security_group_egress_rule.this["all_to_vpc"]: Refreshing state... [id=sgr-0baeef40bfb83cda4]
module.alb.aws_vpc_security_group_ingress_rule.this["http_80"]: Refreshing state... [id=sgr-0c245a05007a44651]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-006acb115586fd5f2]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-04de2315b0837456d]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f575d805863dd1f21080289494]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.db.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=aws-java-ecs-s3-demo-dev-db-20251123044242912300000002]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0346c93d6ffe34127]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0d3073c7f507b80f3]
module.alb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:205190502510:loadbalancer/app/aws-java-ecs-s3-demo-dev-alb/264f11cc6ec6aa19]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0fdb5798020f949c9]
module.ecs_service.aws_security_group.this[0]: Refreshing state... [id=sg-01f93e8aac2b62b36]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-00cfbdfe84908b18c]
module.ecs_service.aws_security_group_rule.this["all_egress"]: Refreshing state... [id=sgrule-2121040287]
module.ecs_service.aws_security_group_rule.this["alb_ingress"]: Refreshing state... [id=sgrule-517749469]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-04fa192b98f201fa61080289494]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-SXFEIBQVY6TYEHFMPZ6XIGUEUY]
module.alb.aws_lb_listener.this["http"]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:205190502510:listener/app/aws-java-ecs-s3-demo-dev-alb/264f11cc6ec6aa19/43df1bc8ca20ed96]
aws_ecs_task_definition.backend: Refreshing state... [id=aws-java-ecs-s3-demo-dev-task]
module.ecs_service.aws_ecs_service.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:205190502510:service/aws-java-ecs-s3-demo-dev-cluster/aws-java-ecs-s3-demo-dev-service]
module.ecs_service.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/aws-java-ecs-s3-demo-dev-cluster/aws-java-ecs-s3-demo-dev-service]
module.ecs_service.aws_appautoscaling_policy.this["memory"]: Refreshing state... [id=memory]
module.ecs_service.aws_appautoscaling_policy.this["cpu"]: Refreshing state... [id=cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.frontend_s3_test.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "aws-java-ecs-s3-demo-dev-frontend-dev-test2hgvs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Env"     = "dev"
          + "Project" = "aws-java-ecs-s3-demo"
        }
      + tags_all                    = {
          + "Env"     = "dev"
          + "Project" = "aws-java-ecs-s3-demo"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.frontend_s3_test.aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerPreferred"
        }
    }

  # module.frontend_s3_test.aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.frontend_s3_test.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.frontend_s3_test.aws_s3_bucket_website_configuration.this will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = "aws-java-ecs-s3-demo-dev-frontend-dev-test2hgvs"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "index.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```